In [6]:
#Codigo sesion5
#Importacion de archivos
#formato de excel
import pandas as pd
# Lee el archivo Excel
df1 = pd.read_excel('base_de_datos.xlsx')
# Muestra el contenido del dataframe
df1

   Nombre     Ciudad  Ingreso  Edad Género Nivel educativo  \
0  Miguel  Cartagena  1632601    63      F    Bachillerato
1   Lucia       Cali  2478095    21      F    Bachillerato
2   Pedro   Medellín  3952242    51      M    Bachillerato
3   Lucia       Cali  4318314    58      F   Universitario
4   Lucia   Medellín  3223645    18      M         Técnico

   Condición de pobreza  Recibe subsidios
0                     0                 0
1                     1                 1
2                     1                 1
3                     0                 0
4                     0                 0

In [7]:
#formato de csv
import pandas as pd
# Lee el archivo de csv
df2 = pd.read_csv('datos.csv')
# Muestra el contenido del dataframe
df2

  Nombre             Ciudad  Ingreso  Edad Genero Nivel educativo  Pobreza  \
0   Juan             Bilbao     1992    67      F    Licenciatura        0
1   Jose  Palma de Mallorca     1029    52      M    Bachillerato        1
2  Laura         Las Palmas     1786    52      M    Licenciatura        1
3   Luis            Sevilla     3207    38      F    Bachillerato        1
4   Juan            Sevilla     1421    28      M    Licenciatura        1

   Subsidio
0         0
1         1
2         1
3         1
4         0

In [28]:
#dta
import pandas as pd
# Importar el archivo a un dataframe
df3 = pd.read_stata('datos.dta')
# Mostrar los primeros registros del dataframe
df3

,nombre,ciudad,ingreso,edad,genero,nivel_educativo,pobreza,subsidio
0,Nombre 1,Ciudad A,4320,57,M,Secundaria,1,1
1,Nombre 2,Ciudad C,1358,22,F,Universidad,1,1
2,Nombre 3,Ciudad C,3500,21,M,Secundaria,0,1
3,Nombre 4,Ciudad C,3895,51,F,Primaria,1,0
4,Nombre 5,Ciudad A,874,60,M,Universidad,1,1
...,...,...,...,...,...,...,...,...
9995,Nombre 9996,Ciudad A,536,62,F,Secundaria,1,1
9996,Nombre 9997,Ciudad A,4761,40,M,Secundaria,1,0
9997,Nombre 9998,Ciudad B,1872,23,M,Universidad,1,1
9998,Nombre 9999,Ciudad A,660,48,M,Primaria,1,1
9999,Nombre 10000,Ciudad A,3114,21,F,Universidad,1,0

In [17]:
#Diferentes formas de mostrar el dataframe
#Mostrar las primeras 5 filas del dataframe
df3.head()

     nombre    ciudad  ingreso  edad genero nivel_educativo  pobreza  subsidio
0  Nombre 1  Ciudad A     4320    57      M      Secundaria        1         1
1  Nombre 2  Ciudad C     1358    22      F     Universidad        1         1
2  Nombre 3  Ciudad C     3500    21      M      Secundaria        0         1
3  Nombre 4  Ciudad C     3895    51      F        Primaria        1         0
4  Nombre 5  Ciudad A      874    60      M     Universidad        1         1

In [18]:
#Mostrar las ultimas filas del dtaframe
df3.tail()

,nombre,ciudad,ingreso,edad,genero,nivel_educativo,pobreza,subsidio
9995,Nombre 9996,Ciudad A,536,62,F,Secundaria,1,1
9996,Nombre 9997,Ciudad A,4761,40,M,Secundaria,1,0
9997,Nombre 9998,Ciudad B,1872,23,M,Universidad,1,1
9998,Nombre 9999,Ciudad A,660,48,M,Primaria,1,1
9999,Nombre 10000,Ciudad A,3114,21,F,Universidad,1,0

In [30]:
#Seleccion de columnas
#metodo del corchete
df3['ingreso']

0       4320
1       1358
2       3500
3       3895
4        874
        ...
9995     536
9996    4761
9997    1872
9998     660
9999    3114
Name: ingreso, Length: 10000, dtype: int32

In [31]:
#Metodo del punto
df3.ingreso

0       4320
1       1358
2       3500
3       3895
4        874
        ...
9995     536
9996    4761
9997    1872
9998     660
9999    3114
Name: ingreso, Length: 10000, dtype: int32

In [33]:
#Seleccionar mas de una columna
df3[['ingreso','genero']]

      ingreso genero
0        4320      M
1        1358      F
2        3500      M
3        3895      F
4         874      M
...       ...    ...
9995      536      F
9996     4761      M
9997     1872      M
9998      660      M
9999     3114      F

[10000 rows x 2 columns]

In [35]:
#Atributos
#dimensiones
df3.shape

(10000, 8)

In [38]:
#indices
df3.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            9990, 9991, 9992, 9993, 9994, 9995, 9996, 9997, 9998, 9999],
           dtype='int64', length=10000)

In [39]:
#columns
df3.columns

Index(['nombre', 'ciudad', 'ingreso', 'edad', 'genero', 'nivel_educativo',
       'pobreza', 'subsidio'],
      dtype='object')

In [40]:
#tipo de datos de cada columna
df3.dtypes

nombre             object
ciudad             object
ingreso             int32
edad                int32
genero             object
nivel_educativo    object
pobreza             int32
subsidio            int32
dtype: object

In [42]:
#Metodos
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nombre           10000 non-null  object
 1   ciudad           10000 non-null  object
 2   ingreso          10000 non-null  int32
 3   edad             10000 non-null  int32
 4   genero           10000 non-null  object
 5   nivel_educativo  10000 non-null  object
 6   pobreza          10000 non-null  int32
 7   subsidio         10000 non-null  int32
dtypes: int32(4), object(4)
memory usage: 546.9+ KB

In [43]:
df3.describe()

            ingreso          edad       pobreza      subsidio
count  10000.000000  10000.000000  10000.000000  10000.000000
mean    2740.953300     41.052500      0.501100      0.496300
std     1312.071423     13.560551      0.500024      0.500011
min      500.000000     18.000000      0.000000      0.000000
25%     1593.000000     29.000000      0.000000      0.000000
50%     2735.000000     41.000000      1.000000      0.000000
75%     3874.000000     53.000000      1.000000      1.000000
max     4999.000000     64.000000      1.000000      1.000000

In [44]:
#Funciones
#numero de filas
len(df3)

10000

In [50]:
#maximo index
max(df3.index)

9999

In [51]:
#minimo index
min(df3.index)

0

In [52]:
#tipo de datos
type(df3)

pandas.core.frame.DataFrame

In [54]:
round(df3['ingreso'],2)

0       4320
1       1358
2       3500
3       3895
4        874
        ...
9995     536
9996    4761
9997    1872
9998     660
9999    3114
Name: ingreso, Length: 10000, dtype: int32